import os
import shutil
import random

# Словар=ь: название -> дата
# data = {
#     "Уфа": "2026-10-05",
#     "Новокуктово": "2026-10-06",
#     "Старогусево": "2026-11-16",
# }
data = {

    "Абдрахимово": "2026-10-06",

    "Абдуллино": "2026-07-15",

    "Абдулово": "2026-08-19",

    "Абзаково": "2026-10-05",

    "Абзаново": "2026-08-19",

    "Аксаитово": "2026-07-06",

    "Алмалы": "2026-08-06",

    "Аркаулово": "2026-10-09",

    "Аскино": "2026-10-21",

    "Ахуново": "2026-08-13",

    "Баимово": "2026-07-16",

    "Байки": "2026-07-17",

    "Байки-Юнусово": "2026-07-14",

    "Баймак": "2026-10-21",

    "Байназарово": "2026-11-17",

    "Барсуанбашево": "2026-08-12",

    "Белебей": "2026-08-18",

    "Белянка": "2026-10-07",

    "Бижбуляк": "2026-11-12",

    "Благовар": "2026-08-19",

    "Благовещенка": "2026-07-24",

    "Болотино": "2026-10-01",

    "Большесухоязово": "2026-09-30",

    "Большеустьикинское": "2026-10-08",

    "Бураево": "2026-10-14",

    "Буранбаево": "2026-10-29",

    "Бурный Поток": "2026-11-16",

    "Валентиновка": "2026-11-27",

    "Верхние Киги": "2026-08-14",

    "Верхние Татышлы": "2026-07-08",

    "Верхний Авзян": "2026-11-18",

    "Восточный": "2026-08-04",

    "Дуван": "2026-08-12",

    "Дуван-Мечетлино": "2026-10-06",

    "Дюртюли": "2026-11-09",

    "Еланлино": "2026-08-03",

    "Еникеево": "2026-10-08",

    "Ермекеево": "2026-08-19",

    "Ермунчино": "2026-11-27",

    "Зейлево": "2026-07-23",

    "Зилаир": "2026-07-14",

    "Ивановка": "2026-10-05",

    "Идельбаково": "2026-08-20",

    "Ильчимбетово": "2026-08-20",

    "Имай-Утарово": "2026-11-23",

    "Имянник": "2026-10-14",

    "Инзер": "2026-10-09",

    "Ирек": "2026-11-06",

    "Исянгулово": "2026-08-05",

    "Ишемгул": "2026-08-18",

    "Ишкулово": "2026-10-06",

    "Иштиряково": "2026-10-15",

    "Казанка": "2026-07-21",

    "Кайраково": "2026-07-10",

    "Калмакларово": "2026-08-10",

    "Кальтяево": "2026-07-09",

    "Камеево": "2026-09-28",

    "Караидель": "2026-07-15",

    "Карасимово": "2026-10-13",

    "Карлыханово": "2026-08-11",

    "Кармаскалы": "2026-11-02",

    "Каскиново": "2026-08-18",

    "Кашкалаши": "2026-11-03",

    "Кашкарово": "2026-10-08",

    "Кашкино": "2026-07-16",

    "Комсомольск": "2026-10-28",

    "Красноусольский": "2026-09-30",

    "Красный Маяк": "2026-10-21",

    "Кугарчи": "2026-07-07",

    "Курманаево": "2026-07-23",

    "Кусимово": "2026-10-06",

    "Куюргазы": "2026-10-22",

    "Леуза": "2026-08-05",

    "Магинск": "2026-07-14",

    "Майский": "2026-11-26",

    "Межгорье (Центральный)": "2026-11-05",

    "Межгорье (Юго-Западный)": "2026-11-06",

    "Месягутово": "2026-08-07",

    "Метевбаш": "2026-08-21",

    "Метели": "2026-08-12",

    "Миндяк": "2026-10-27",

    "Михайловка": "2026-09-28",

    "Мраково": "2026-08-21",

    "Набережный": "2026-10-07",

    "Нагаево": "2026-07-31",

    "Наумовка": "2026-09-29",

    "Нижнетроицкий": "2026-08-20",

    "Николаевка": "2026-10-02",

    "Новая Казанковка": "2026-07-31",

    "Новобабичево": "2026-10-16",

    "Новобелокатай": "2026-10-07",

    "Новокуктово": "2026-11-18",

    "Новоминзитарово": "2026-11-11",

    "Новонадеждино": "2026-08-11",

    "Новотавларово": "2026-08-13",

    "Новохвалынский": "2026-07-10",

    "Новые Казанчи": "2026-10-22",

    "Новые Тукмаклы": "2026-11-05",

    "Нугуш": "2026-10-23",

    "Нуреево": "2026-08-17",

    "Нурлино": "2026-10-13",

    "Октябрьский": "2026-10-19",

    "Первомайский": "2026-08-17",

    "Петропавловка": "2026-09-28",

    "Подлубово": "2026-09-29",

    "Равилово": "2026-10-07",

    "Рождественское": "2026-11-12",

    "Романовка": "2026-08-17",

    "Саитбаба": "2026-11-10",

    "Салаватово": "2026-10-07",

    "Салихово": "2026-08-03",

    "Свобода": "2026-08-04",

    "Семилетка": "2026-07-21",

    "Серменево": "2026-10-30",

    "Сибай": "2026-07-15",

    "Староактау": "2026-10-15",

    "Старобайрамгулово": "2026-10-28",

    "Старогусево": "2026-11-17",

    "Староежово": "2026-07-24",

    "Староисаево": "2026-07-29",

    "Старокальмиярово": "2026-07-07",

    "Старосубхангулово": "2026-11-17",

    "Старые Тукмаклы": "2026-11-18",

    "Старый Курдым": "2026-11-10",

    "Стерлибашево": "2026-07-30",

    "Суерметово": "2026-11-24",

    "Тавтиманово": "2026-08-14",

    "Тазларово": "2026-07-09",

    "Темясово": "2026-10-22",

    "Тереклы": "2026-08-10",

    "Тимяшево": "2026-11-10",

    "Толбазы": "2026-07-30",

    "Тубяк-Тазларово": "2026-11-25",

    "Туймазы": "2026-10-19",

    "Тукан": "2026-11-20",

    "Туркменево 1-Е": "2026-10-27",

    "Тюлябаево": "2026-07-06",

    "Тюпкильды": "2026-11-23",

    "Узян": "2026-11-18",

    "Уманка": "2026-10-06",

    "Умирово": "2026-07-22",

    "Уральск": "2026-10-27",

    "Ургала": "2026-08-06",

    "Ургуш": "2026-10-01",

    "Утягулово": "2026-08-20",

    "Уфа": "2026-07-20",

    "Уфа РЦФМ": "2026-10-19",

    "Учалле *": "2026-11-11",

    "Учалы (Город)": "2026-10-29",

    "Чишма": "2026-11-09",

    "Шафраново": "2026-11-13",

    "Шигаево": "2026-11-16",

    "Шулганово": "2026-11-25",

    "Югамаш": "2026-11-25",

    "Юлдашево": "2026-10-29",

    "Юмашево": "2026-10-29",

    "Язги-Юрт": "2026-10-05",

    "Якты-Ялан": "2026-07-22",

    "Яныбаево": "2026-08-05",

    "Яшерганово": "2026-11-11"

}
SRC_DIR = "/home/sem/py/pdf_name/data_base_py/fhoto_data_base"
BASE_DIR = "/home/sem/py/pdf_name/pustie"

# Все png файлы в источнике
all_files = [f for f in os.listdir(SRC_DIR) if f.endswith(".png")]

for name, date in data.items():
    # Создаём папку с названием
    project_dir = os.path.join(BASE_DIR, f"{date} {name}")
    os.makedirs(project_dir, exist_ok=True)

    for mux in ["1mux", "2mux"]:
        mux_dir = os.path.join(project_dir, mux)
        os.makedirs(mux_dir, exist_ok=True)

        # ========================================
        # Рандомно выбираем 6 файлов
        # chosen = random.sample(all_files, 6)
        #
        # for i, src_file in enumerate(chosen, start=1):
        #     dst = os.path.join(mux_dir, f"{i}.png")
        #     shutil.copy2(os.path.join(SRC_DIR, src_file), dst)
        #     print(f"{mux_dir}: {src_file} -> {i}.png")

        num = random.randint(1, 5)

        for i in range(1, 7):
            src_file = f"{num}{i}.png"
            src_path = os.path.join(SRC_DIR, src_file)
            dst = os.path.join(mux_dir, f"{i}.png")

            if os.path.exists(src_path):
                shutil.copy2(src_path, dst)
                print(f"{mux_dir}: {src_file} -> {i}.png")
            else:
                print(f"Файл {src_file} не найден в {SRC_DIR}")

print("Готово.")
